app/controllers/comments_controller.rb

  def turret
    @title="Turret"
    @comment = Comment.new
    @comment.idd='turret';

#    @comments = Comment.all
    @comments = Comment.where(:idd => 'turret')
---
SELECT "comments".* FROM "comments" WHERE "comments"."idd" = 'turret'

  def rc
    @title="RC Car"
    @comment = Comment.new
    @comment.idd='rc';

#    @comments = Comment.all
    @comments = Comment.where(:idd => 'rc')
---
SELECT "comments".* FROM "comments" WHERE "comments"."idd" = 'rc'

  def coordinate
    @title="3D-Controller"
    @comment = Comment.new
    @comment.idd='3d';

#    @comments = Comment.all
    @comments = Comment.where(:idd => '3d')
---
SELECT "comments".* FROM "comments" WHERE "comments"."idd" = '3d'

  def ece297
    @title="ECE297"
    @comment = Comment.new
    @comment.idd='ece297';

#    @comments = Comment.all
    @comments = Comment.where(:idd => 'ece297')
---
SELECT "comments".* FROM "comments" WHERE "comments"."idd" = 'ece297' LIMIT 1

  def ece241
    @title="ECE241"
    @comment = Comment.new
    @comment.idd='ece241';
#    @comments = Comment.all
    @comments = Comment.where(:idd => 'ece241')
---
SELECT "comments".* FROM "comments" WHERE "comments"."idd" = 'ece241'

  def ece243
    @title="ECE243"
    @comment = Comment.new
    @comment.idd='ece243';
#    @comments = Comment.all
    @comments = Comment.where(:idd => 'ece243')
---
SELECT "comments".* FROM "comments" WHERE "comments"."idd" = 'ece243'

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("name", "email", "idd", "comment", "created_at", "updated_at") VALUES ('wasi', 'wasi.ahmed@gmail.com', NULL, 'test comment 1', '2012-01-03 02:51:43.141793', '2012-01-03 02:51:43.141793')

  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 5 LIMIT 1
UPDATE "comments" SET "name" = 'aopfh', "email" = 'vn;shg', "comment" = 'sbjhejwdlxzclmk', "updated_at" = '2012-01-04 04:19:15.531319' WHERE "comments"."id" = 5