app/controllers/comments_controller.rb

  def ece297
    @title="ECE297"
    @comment = Comment.new
    @comment.idd='ece297';
    @comments = Comment.all
---
SELECT "comments".* FROM "comments" LIMIT 1